Refactor structures.
